[
  {
    "name": "Tokyo",
    "description": "Capital of Japan, blending tradition and modernity. Famous for Shibuya Crossing, Tokyo Tower, anime culture, and cutting-edge technology."
  },
  {
    "name": "Kyoto",
    "description": "Ancient capital of Japan, known for its temples, shrines, and tea houses. A cultural treasure with geisha districts and seasonal festivals."
  },
  {
    "name": "Osaka",
    "description": "Japan’s kitchen, famous for takoyaki and okonomiyaki. Known for Osaka Castle, Universal Studios Japan, and its vibrant nightlife."
  },
  {
    "name": "Hiroshima",
    "description": "Historic city remembered for the Peace Memorial Park and Atomic Bomb Dome. Also known for Itsukushima Shrine and local okonomiyaki."
  },
  {
    "name": "Sapporo",
    "description": "Capital of Hokkaido, popular for its Snow Festival, skiing, and beer. Famous for miso ramen and beautiful winter landscapes."
  },
  {
    "name": "Nara",
    "description": "Japan’s first permanent capital, home to Todai-ji Temple and the Great Buddha. Famous for Nara Park where friendly deer roam freely."
  },
  {
    "name": "Fukuoka",
    "description": "Major city on Kyushu Island, well-known for Hakata ramen and lively street food stalls. A hub for festivals and cultural exchange."
  },
  {
    "name": "Yokohama",
    "description": "Port city near Tokyo with Japan’s largest Chinatown. Famous for Cup Noodles Museum, waterfront parks, and the Minato Mirai skyline."
  },
  {
    "name": "Nagoya",
    "description": "Industrial hub and home of Toyota, with cultural landmarks like Nagoya Castle. Offers unique miso katsu cuisine and modern shopping areas."
  },
  {
    "name": "Hakone",
    "description": "Famous hot spring resort town with views of Mount Fuji. Known for Lake Ashi cruises, Hakone Shrine, and scenic ropeways."
  },
  {
    "name": "Kobe",
    "description": "A vibrant port city famous for Kobe beef, scenic harbor views, and the historic Kitano district. Offers Mount Rokko, Chinatown, and modern shopping."
  },
  {
    "name": "Kanazawa",
    "description": "A cultural city known for Kenrokuen Garden, Kanazawa Castle, and traditional tea houses. Famous for gold leaf crafts and preserved samurai districts."
  },
  {
    "name": "Nagasaki",
    "description": "A historic port city remembered for its unique blend of Japanese and European culture. Highlights include Glover Garden, Dejima, and the Atomic Bomb Museum."
  },
  {
    "name": "Kamakura",
    "description": "A coastal city with historic temples and shrines, including the Great Buddha. Known for scenic hiking trails, beaches, and traditional shopping streets."
  },
  {
    "name": "Takayama",
    "description": "A beautifully preserved Edo-period town in the Japanese Alps. Famous for its old town, Hida Folk Village, morning markets, and seasonal festivals."
  },
  {
    "name": "Matsumoto",
    "description": "A castle town famous for Matsumoto Castle, historic streets, and modern art museums. Nearby Kamikochi offers stunning alpine nature and hiking."
  },
  {
    "name": "Matsuyama",
    "description": "Known for Matsuyama Castle, Dogo Onsen, and historic temples. Offers retro charm with the Botchan Train and scenic coastal views."
  },
  {
    "name": "Kumamoto",
    "description": "A castle city with Kumamoto Castle, Suizenji Garden, and Hosokawa Mansion. Offers family-friendly attractions like the zoo and botanical gardens."
  },
  {
    "name": "Nikko",
    "description": "Famous for Toshogu Shrine, Shinkyo Bridge, Kegon Falls, and Lake Chuzenji. A scenic and spiritual destination with Edo-period cultural experiences."
  },
  {
    "name": "Ise",
    "description": "Sacred city home to Ise Grand Shrine, Okage Yokocho, and Futami Wedded Rocks. Known for spiritual heritage, traditional shopping streets, and scenic coastal views."
  }
]
